SolderedElectronics/Inkplate-Board-Definitions-for-Arduino-IDE/Inkplate_core-2.0.0/boards.txt
Inkplate6plusV2.menu.FlashMode.qio=QIO
Inkplate6plusV2.menu.FlashMode.qio.build.flash_mode=dio
Inkplate6plusV2.menu.FlashMode.qio.build.boot=qio
Inkplate6plusV2.menu.FlashMode.dio=DIO
Inkplate6plusV2.menu.FlashMode.dio.build.flash_mode=dio
Inkplate6plusV2.menu.FlashMode.dio.build.boot=dio
Inkplate6plusV2.menu.FlashMode.qout=QOUT
Inkplate6plusV2.menu.FlashMode.qout.build.flash_mode=dout
Inkplate6plusV2.menu.FlashMode.qout.build.boot=qout
Inkplate6plusV2.menu.FlashMode.dout=DOUT
Inkplate6plusV2.menu.FlashMode.dout.build.flash_mode=dout
Inkplate6plusV2.menu.FlashMode.dout.build.boot=dout

Inkplate6plusV2.menu.FlashFreq.80=80MHz
Inkplate6plusV2.menu.FlashFreq.80.build.flash_freq=80m
Inkplate6plusV2.menu.FlashFreq.40=40MHz
Inkplate6plusV2.menu.FlashFreq.40.build.flash_freq=40m

Inkplate6plusV2.menu.UploadSpeed.921600=921600
Inkplate6plusV2.menu.UploadSpeed.921600.upload.speed=921600
Inkplate6plusV2.menu.UploadSpeed.115200=115200
Inkplate6plusV2.menu.UploadSpeed.115200.upload.speed=115200
Inkplate6plusV2.menu.UploadSpeed.256000.windows=256000
Inkplate6plusV2.menu.UploadSpeed.256000.upload.speed=256000
Inkplate6plusV2.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate6plusV2.menu.UploadSpeed.230400=230400
Inkplate6plusV2.menu.UploadSpeed.230400.upload.speed=230400
Inkplate6plusV2.menu.UploadSpeed.460800.linux=460800
Inkplate6plusV2.menu.UploadSpeed.460800.macosx=460800
Inkplate6plusV2.menu.UploadSpeed.460800.upload.speed=460800
Inkplate6plusV2.menu.UploadSpeed.512000.windows=512000
Inkplate6plusV2.menu.UploadSpeed.512000.upload.speed=512000

Inkplate6plusV2.menu.DebugLevel.none=None
Inkplate6plusV2.menu.DebugLevel.none.build.code_debug=0
Inkplate6plusV2.menu.DebugLevel.error=Error
Inkplate6plusV2.menu.DebugLevel.error.build.code_debug=1
Inkplate6plusV2.menu.DebugLevel.warn=Warn
Inkplate6plusV2.menu.DebugLevel.warn.build.code_debug=2
Inkplate6plusV2.menu.DebugLevel.info=Info
Inkplate6plusV2.menu.DebugLevel.info.build.code_debug=3
Inkplate6plusV2.menu.DebugLevel.debug=Debug
Inkplate6plusV2.menu.DebugLevel.debug.build.code_debug=4
Inkplate6plusV2.menu.DebugLevel.verbose=Verbose
Inkplate6plusV2.menu.DebugLevel.verbose.build.code_debug=5

Inkplate6plusV2.menu.EraseFlash.none=Disabled
Inkplate6plusV2.menu.EraseFlash.none.upload.erase_cmd=
Inkplate6plusV2.menu.EraseFlash.all=Enabled
Inkplate6plusV2.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

Inkplate6Flick.name=Soldered Inkplate 6 FLICK

Inkplate6Flick.bootloader.tool=esptool_py
Inkplate6Flick.bootloader.tool.default=esptool_py

Inkplate6Flick.upload.tool=esptool_py
Inkplate6Flick.upload.tool.default=esptool_py
Inkplate6Flick.upload.tool.network=esp_ota

Inkplate6Flick.upload.maximum_size=1310720
Inkplate6Flick.upload.maximum_data_size=327680
Inkplate6Flick.upload.flags=
Inkplate6Flick.upload.extra_flags=

Inkplate6Flick.serial.disableDTR=true
Inkplate6Flick.serial.disableRTS=true

Inkplate6Flick.build.tarch=xtensa
Inkplate6Flick.build.bootloader_addr=0x1000
Inkplate6Flick.build.target=esp32
Inkplate6Flick.build.mcu=esp32
Inkplate6Flick.build.core=esp32
Inkplate6Flick.build.variant=Inkplate
Inkplate6Flick.build.board=INKPLATE6FLICK

Inkplate6Flick.build.f_cpu=240000000L
Inkplate6Flick.build.flash_size=4MB
Inkplate6Flick.build.flash_freq=80m
Inkplate6Flick.build.flash_mode=qio
Inkplate6Flick.build.boot=dio
Inkplate6Flick.build.partitions=default
Inkplate6Flick.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-strategy=memw
Inkplate6Flick.build.extra_libs=

Inkplate6Flick.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.huge_app.build.partitions=huge_app
Inkplate6Flick.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
Inkplate6Flick.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.default.build.partitions=default
Inkplate6Flick.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
Inkplate6Flick.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
Inkplate6Flick.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
Inkplate6Flick.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.minimal.build.partitions=minimal
Inkplate6Flick.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.no_ota.build.partitions=no_ota
Inkplate6Flick.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
Inkplate6Flick.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
Inkplate6Flick.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
Inkplate6Flick.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
Inkplate6Flick.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
Inkplate6Flick.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
Inkplate6Flick.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
Inkplate6Flick.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
Inkplate6Flick.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
Inkplate6Flick.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
Inkplate6Flick.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
Inkplate6Flick.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
Inkplate6Flick.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
Inkplate6Flick.menu.PartitionScheme.fatflash.build.partitions=ffat

Inkplate6Flick.menu.FlashMode.qio=QIO
Inkplate6Flick.menu.FlashMode.qio.build.flash_mode=dio
Inkplate6Flick.menu.FlashMode.qio.build.boot=qio
Inkplate6Flick.menu.FlashMode.dio=DIO
Inkplate6Flick.menu.FlashMode.dio.build.flash_mode=dio
Inkplate6Flick.menu.FlashMode.dio.build.boot=dio
Inkplate6Flick.menu.FlashMode.qout=QOUT
Inkplate6Flick.menu.FlashMode.qout.build.flash_mode=dout
Inkplate6Flick.menu.FlashMode.qout.build.boot=qout
Inkplate6Flick.menu.FlashMode.dout=DOUT
Inkplate6Flick.menu.FlashMode.dout.build.flash_mode=dout
Inkplate6Flick.menu.FlashMode.dout.build.boot=dout

Inkplate6Flick.menu.FlashFreq.80=80MHz
Inkplate6Flick.menu.FlashFreq.80.build.flash_freq=80m
Inkplate6Flick.menu.FlashFreq.40=40MHz
Inkplate6Flick.menu.FlashFreq.40.build.flash_freq=40m

Inkplate6Flick.menu.UploadSpeed.921600=921600
Inkplate6Flick.menu.UploadSpeed.921600.upload.speed=921600
Inkplate6Flick.menu.UploadSpeed.115200=115200
Inkplate6Flick.menu.UploadSpeed.115200.upload.speed=115200
Inkplate6Flick.menu.UploadSpeed.256000.windows=256000
Inkplate6Flick.menu.UploadSpeed.256000.upload.speed=256000
Inkplate6Flick.menu.UploadSpeed.230400.windows.upload.speed=256000
Inkplate6Flick.menu.UploadSpeed.230400=230400
Inkplate6Flick.menu.UploadSpeed.230400.upload.speed=230400
Inkplate6Flick.menu.UploadSpeed.460800.linux=460800
Inkplate6Flick.menu.UploadSpeed.460800.macosx=460800
Inkplate6Flick.menu.UploadSpeed.460800.upload.speed=460800
Inkplate6Flick.menu.UploadSpeed.512000.windows=512000
Inkplate6Flick.menu.UploadSpeed.512000.upload.speed=512000

Inkplate6Flick.menu.DebugLevel.none=None
Inkplate6Flick.menu.DebugLevel.none.build.code_debug=0
Inkplate6Flick.menu.DebugLevel.error=Error
Inkplate6Flick.menu.DebugLevel.error.build.code_debug=1
Inkplate6Flick.menu.DebugLevel.warn=Warn
Inkplate6Flick.menu.DebugLevel.warn.build.code_debug=2
Inkplate6Flick.menu.DebugLevel.info=Info
Inkplate6Flick.menu.DebugLevel.info.build.code_debug=3
Inkplate6Flick.menu.DebugLevel.debug=Debug
Inkplate6Flick.menu.DebugLevel.debug.build.code_debug=4
Inkplate6Flick.menu.DebugLevel.verbose=Verbose
Inkplate6Flick.menu.DebugLevel.verbose.build.code_debug=5

Inkplate6Flick.menu.EraseFlash.none=Disabled
Inkplate6Flick.menu.EraseFlash.none.upload.erase_cmd=
Inkplate6Flick.menu.EraseFlash.all=Enabled
Inkplate6Flick.menu.EraseFlash.all.upload.erase_cmd=-e

